Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotPasteViewSpecElemsFromDiffViews Property
 Cannot paste view-specific elements from different views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPasteViewSpecElemsFromDiffViews { get; }
Public Shared ReadOnly Property CannotPasteViewSpecElemsFromDiffViews As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPasteViewSpecElemsFromDiffViews {
	FailureDefinitionId^ get ();
}
static member CannotPasteViewSpecElemsFromDiffViews : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace